In [1]:
import pandas as pd

In [10]:
sir_ranks = pd.read_csv("./ranks/sir_v2.csv")
sir_ranks = sir_ranks.sort_values(by="score")
sir_ranks.head()

          username  score
0  deepikapadukone    1.0
1   RobertDowneyJr    1.0
2         tomhanks    1.0
3       XabiAlonso    1.0
4        paulpogba    1.0

In [12]:
page_ranks = pd.read_csv("./ranks/page_rank_output.csv")
page_ranks = page_ranks.sort_values(by="Page Rank", ascending=False)
page_ranks.head()

              Name      User Id  Page Rank  In-Degree  Out-Degree
0  deepikapadukone  101695592.0  62.098401       1025           0
1  SteveMartinToGo   14824849.0  58.411291        203           2
2         tomhanks   50374439.0  49.720552        418           1
3       DonRickles  292599839.0  28.454043          9           0
4        bhorowitz   16242081.0  26.337149        321          12

In [16]:
user_ranks = pd.read_csv("./ranks/user_rank_1_output.csv")
user_ranks = user_ranks.sort_values(by="User Rank(In)", ascending=False)
user_ranks.head()

              Name       User Id  User Rank(In)  In-Degree  Out-Degree
0  deepikapadukone  1.016956e+08      18.021953       1025           0
1    iamjohnoliver  3.163891e+08       2.132482        358           0
2         tomhanks  5.037444e+07       1.552374        418           1
3   RobertDowneyJr  4.778610e+07       1.228223        298           1
4       SGanguly99  2.708915e+09       0.654428        346           5

# measuring with "Page Rank"

In [35]:
test = []
pred = []
for i in range(100):
    test.append(page_ranks['Name'][i])
    pred.append(sir_ranks['username'][i])

In [38]:
count = 0
for i in test:
    if i in pred:
        count += 1
print(count, "users matched in top 100 of page rank and sir")

33 users matched in top 100 of page rank and sir

# measuring with "User Rank"

In [39]:
test2 = []

for i in range(100):
    test2.append(user_ranks['Name'][i])
    pred.append(sir_ranks['username'][i])

count = 0
for i in test2:
    if i in pred:
        count += 1
print(count, "users matched in top 100 of user rank and sir")

40 users matched in top 100 of user rank and sir